Documents/ЗагрузкаКамеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗагрузкаКамеры</Name>
			<BasedOn>
				<xr:Item>Document.НачалоТермообработки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КамераТермообработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КамерыТермообработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодПрограммыТермообработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженаЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженаМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗанятаМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачалоТермообработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗагрузкаКамеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободнаДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободнаЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободнаМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьНеоконченыеПроцессы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогРамПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТМЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРамы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоРам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчетПроизводства</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоТермообработки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НачалоТермообработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗагрузкаКамеры/Ext/ManagerModule.bsl
// Продолжение термообработки в следующей камере (создание ЗагрузкаКамеры
// на основании другой ЗагрузкаКамеры) — аналог 1С77 (ВводНаОсновании,
// ветка "УМК_ЗагрузкаКамеры"). Каждая позиция ТМЦ может иметь свой
// следующий этап обработки (Справочник.ПодпрограммыНоменклатуры,
// упорядоченный по Коду), поэтому пользователь выбирает ОДНУ подпрограмму
// продолжения — все позиции этой подпрограммы попадают в новый документ. // + claude

// Возвращает следующую по коду подпрограмму из последовательности
// обработки номенклатуры после текущей. Пустая ссылка, если текущая
// подпрограмма последняя (обработка окончена) или не найдена. // + claude
Функция ОпределитьСледующуюПодпрограмму(Номенклатура, ТекущаяПодпрограмма) Экспорт

	// 1С не допускает скалярный подзапрос прямо в сравнении ГДЕ — сначала
	// отдельным запросом получаем Код текущей подпрограммы у этой позиции. // + claude
	ЗапросКода = Новый Запрос;
	ЗапросКода.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодпрограммыНоменклатуры.Код КАК Код
		|ИЗ
		|	Справочник.ПодпрограммыНоменклатуры КАК ПодпрограммыНоменклатуры
		|ГДЕ
		|	ПодпрограммыНоменклатуры.Владелец = &Номенклатура
		|	И ПодпрограммыНоменклатуры.Подпрограмма = &ТекущаяПодпрограмма";
	ЗапросКода.УстановитьПараметр("Номенклатура", Номенклатура);
	ЗапросКода.УстановитьПараметр("ТекущаяПодпрограмма", ТекущаяПодпрограмма);

	ВыборкаКода = ЗапросКода.Выполнить().Выбрать();
	Если НЕ ВыборкаКода.Следующий() Тогда
		Возврат Справочники.ПодПрограммыТермообработки.ПустаяСсылка();
	КонецЕсли; // текущая подпрограмма не найдена у этой позиции

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодпрограммыНоменклатуры.Подпрограмма КАК Подпрограмма
		|ИЗ
		|	Справочник.ПодпрограммыНоменклатуры КАК ПодпрограммыНоменклатуры
		|ГДЕ
		|	ПодпрограммыНоменклатуры.Владелец = &Номенклатура
		|	И НЕ ПодпрограммыНоменклатуры.ПометкаУдаления
		|	И ПодпрограммыНоменклатуры.Код > &ТекущийКод
		|УПОРЯДОЧИТЬ ПО
		|	ПодпрограммыНоменклатуры.Код";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТекущийКод", ВыборкаКода.Код);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Подпрограмма;
	КонецЕсли; // есть следующая подпрограмма

	Возврат Справочники.ПодПрограммыТермообработки.ПустаяСсылка();

КонецФункции // ОпределитьСледующуюПодпрограмму() // + claude

// Строит таблицу возможных продолжений: по каждой строке ТМЦ источника
// определяет следующую подпрограмму, группирует (Подпрограмма, ТМЦ,
// ОтчетПроизводства) и вычитает количества, уже отправленные в другие
// ЗагрузкаКамеры с тем же ДокументОснование (аналог 1С77: вычитание по
// подчиненным документам) — повторный запуск остаётся идемпотентным. // + claude
Функция ПостроитьТаблицуПродолжения(ИсходнаяЗагрузка) Экспорт

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Подпрограмма");
	ТЗ.Колонки.Добавить("ТМЦ");
	ТЗ.Колонки.Добавить("ОтчетПроизводства");
	ТЗ.Колонки.Добавить("НачалоТермообработки");
	ТЗ.Колонки.Добавить("Кво",    Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("КвоРам", Новый ОписаниеТипов("Число"));

	Если НЕ ЗначениеЗаполнено(ИсходнаяЗагрузка) Тогда
		Возврат ТЗ;
	КонецЕсли; // источник не задан

	ДокИсточник = ИсходнаяЗагрузка.ПолучитьОбъект();

	Для Каждого СтрокаИсточника Из ДокИсточник.ТМЦ Цикл

		СледПодпрограмма = ОпределитьСледующуюПодпрограмму(СтрокаИсточника.ТМЦ, ДокИсточник.ПодПрограмма);
		Если НЕ ЗначениеЗаполнено(СледПодпрограмма) Тогда
			Продолжить; // для этой позиции обработка окончена
		КонецЕсли;

		НайденныеСтроки = ТЗ.НайтиСтроки(Новый Структура(
			"Подпрограмма, ТМЦ, ОтчетПроизводства",
			СледПодпрограмма, СтрокаИсточника.ТМЦ, СтрокаИсточника.ОтчетПроизводства));

		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаТЗ = НайденныеСтроки[0];
			СтрокаТЗ.Кво    = СтрокаТЗ.Кво    + СтрокаИсточника.Кво;
			СтрокаТЗ.КвоРам = СтрокаТЗ.КвоРам + СтрокаИсточника.КвоРам;
		Иначе
			СтрокаТЗ                       = ТЗ.Добавить();
			СтрокаТЗ.Подпрограмма          = СледПодпрограмма;
			СтрокаТЗ.ТМЦ                   = СтрокаИсточника.ТМЦ;
			СтрокаТЗ.ОтчетПроизводства     = СтрокаИсточника.ОтчетПроизводства;
			СтрокаТЗ.НачалоТермообработки  = СтрокаИсточника.НачалоТермообработки;
			СтрокаТЗ.Кво                   = СтрокаИсточника.Кво;
			СтрокаТЗ.КвоРам                = СтрокаИсточника.КвоРам;
		КонецЕсли; // группировка по (Подпрограмма, ТМЦ, ОтчетПроизводства)

	КонецЦикла; // перебор строк источника

	// Вычитаем уже отправленное в другие ЗагрузкаКамеры на этом же основании
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗагрузкаТМЦ.ТМЦ КАК ТМЦ,
		|	ЗагрузкаТМЦ.Кво КАК Кво,
		|	ЗагрузкаТМЦ.КвоРам КАК КвоРам
		|ИЗ
		|	Документ.ЗагрузкаКамеры.ТМЦ КАК ЗагрузкаТМЦ
		|ГДЕ
		|	ЗагрузкаТМЦ.Ссылка.ДокументОснование = &ИсходнаяЗагрузка
		|	И ЗагрузкаТМЦ.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ИсходнаяЗагрузка", ИсходнаяЗагрузка);
	ВыборкаУже = Запрос.Выполнить().Выбрать();

	Пока ВыборкаУже.Следующий() Цикл
		НайденныеСтроки = ТЗ.НайтиСтроки(Новый Структура("ТМЦ", ВыборкаУже.ТМЦ));
		Для Каждого СтрокаТЗ Из НайденныеСтроки Цикл
			СтрокаТЗ.Кво    = СтрокаТЗ.Кво    - ВыборкаУже.Кво;
			СтрокаТЗ.КвоРам = СтрокаТЗ.КвоРам - ВыборкаУже.КвоРам;
		КонецЦикла; // распределяем вычет по всем найденным строкам ТМЦ
	КонецЦикла; // перебор уже отправленного

	// Удаляем строки с исчерпанным количеством
	Индекс = ТЗ.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Если ТЗ[Индекс].КвоРам <= 0 Тогда
			ТЗ.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла; // очистка исчерпанных строк

	Возврат ТЗ;

КонецФункции // ПостроитьТаблицуПродолжения() // + claude

// Возвращает варианты продолжения, сгруппированные по подпрограмме —
// для показа пользователю списка выбора (Подпрограмма, КвоРам). // + claude
Функция ПолучитьВариантыПродолжения(ИсходнаяЗагрузка) Экспорт

	ТЗ = ПостроитьТаблицуПродолжения(ИсходнаяЗагрузка);
	ТЗ.Свернуть("Подпрограмма", "КвоРам");
	Возврат ТЗ;

КонецФункции // ПолучитьВариантыПродолжения() // + claude

// Возвращает построчные данные продолжения (не сгруппированные по подпрограмме)
// для выбранной пользователем подпрограммы — используется в ОбработкаЗаполнения. // + claude
Функция ПолучитьСтрокиПродолжения(ИсходнаяЗагрузка, ВыбраннаяПодпрограмма) Экспорт

	ТЗ = ПостроитьТаблицуПродолжения(ИсходнаяЗагрузка);
	ТЗ = ТЗ.Скопировать(ТЗ.НайтиСтроки(Новый Структура("Подпрограмма", ВыбраннаяПодпрограмма)));
	Возврат ТЗ;

КонецФункции // ПолучитьСтрокиПродолжения() // + claude
